## Importing the Depenencies

In [3]:
import os
import numpy as np
import pandas as pd
from PIL import Image
import matplotlib.pyplot as plt
import matplotlib.image as mpimg
from sklearn.model_selection import train_test_split

In [4]:
filenames = os.listdir('/home/mitraa/Jupyter Notebook/Dataset2/train')

In [5]:
type(filenames)

list

In [6]:
len(filenames)

50000

In [7]:
print(filenames[0:5])
print(filenames[-5:])

['39438.png', '16567.png', '48414.png', '29646.png', '7071.png']
['28160.png', '470.png', '37186.png', '20842.png', '10970.png']

## Labels Processing

In [8]:
labels_df = pd.read_csv('/home/mitraa/Jupyter Notebook/Dataset2/trainLabels.csv')
labels_df.shape

(50000, 2)

In [9]:
labels_df.head()

   id       label
0   1        frog
1   2       truck
2   3       truck
3   4        deer
4   5  automobile

In [10]:
labels_df[labels_df['id'] == 7796]

        id label
7795  7796  frog

In [11]:
labels_df.head(10)

   id       label
0   1        frog
1   2       truck
2   3       truck
3   4        deer
4   5  automobile
5   6  automobile
6   7        bird
7   8       horse
8   9        ship
9  10         cat

In [12]:
labels_df.tail(10)

          id       label
49990  49991        deer
49991  49992        bird
49992  49993    airplane
49993  49994  automobile
49994  49995    airplane
49995  49996        bird
49996  49997        frog
49997  49998       truck
49998  49999  automobile
49999  50000  automobile

In [13]:
labels_df['label'].value_counts()

label
frog          5000
truck         5000
deer          5000
automobile    5000
bird          5000
horse         5000
ship          5000
cat           5000
dog           5000
airplane      5000
Name: count, dtype: int64

In [14]:
labels_df['label']

0              frog
1             truck
2             truck
3              deer
4        automobile
            ...
49995          bird
49996          frog
49997         truck
49998    automobile
49999    automobile
Name: label, Length: 50000, dtype: object

In [15]:
labels_dirctionary = {'airplane':0, 'automobile':1, 'bird':2, 'cat':3, 'dree':4, 'dog':5, 'frog':6, 'horse':7, 'ship':8, 'truck':9}

labels = [labels_dirctionary[i] in labels_df['label']]

print(labels[0:5])
print(labels[-5:])

NameError: name 'i' is not defined